[
    {
        "eventId": "1",
        "eventName": "Quixote Nuevo",
        "directorOrganizer": "Lisa Portes",
        "type": "Play",
        "size": "small",
        "cost": "high",
        "start": "2024-01-19",
        "endDate": "2024-02-11",
        "sessions": [
            {
              "date": "2024-01-28",
              "times": ["2:45 PM", "5:30 PM"]
            },
            {
              "date": "2024-02-01",
              "times": ["10:30 AM", "7:30 PM"]
            },
            {
                "date": "2024-02-02",
                "times": ["6:30 PM"]
            },
              {
                "date": "2024-02-03",
                "times": ["1:00 PM", "2:00 PM"]
            },
            {
                "date": "2024-02-07",
                "times": ["12:00 PM"]
              },
              {
                "date": "2024-02-10",
                "times": ["2:00 PM"]
              },
              {
                "date": "2024-02-11",
                "times": ["12:00 PM"]
              }



        ],
        "venue": "Bagley Wright Theater",
        "address": "155 Mercer St, Seattle, WA 98109",
        "description": "Aging Cervantes professor Jose Quijano isn’t going down without a fight. When his family tries to move him to an assisted living facility, Jose escapes on his valiant tricycle steed in search of his long-lost love. Reality and fantasy blur in the Texas desert, as Jose dubs himself Don Quixote and embarks on a fantastic, death-defying journey to discover the truth of his past. Underscored by vibrant Tejano music, Quixote Nuevo is a humorous and heartfelt quest towards becoming the hero of your own story.",
        "condensedDescription": "Aging Cervantes professor Jose Quijano isn’t going down without a fight. When his family tries to move him to an assisted living facility, Jose escapes on his valiant tricycle steed in search of his long-lost love. Reality and fantasy blur in the Texas desert, as Jose dubs himself Don Quixote and embarks on a fantastic, death-defying journey to discover the truth of his past...",
        "link": "https://www.seattlerep.org/plays/202324-season/quixote-nuevo/",
        "image": "/images/quixote-3.jpg",
        "alt": "Actors of Quixote Nuevo on stage",
        "reviewOne": "Brilliant yet accessible, visually stunning, and truly fun despite being emotionally complex. - DAILYUW",
        "reviewTwo": "Quixote Nuevo commands the stage, reminding audiences what it means to be epic…Go see the play for yourself! - DRAMA IN THE HOOD"
    },
    {
        "eventId": "2",
        "eventName": "Sanctuary City",
        "directorOrganizer": "Desdemona Chiang",
        "type": "Play",
        "size": "medium",
        "cost": "high",
        "start": "2024-03-01",
        "endDate": "2024-03-31",
        "sessions": [
            {
              "date": "2024-03-10",
              "times": ["12:00 PM", "5:30 PM"]
            },
            {
              "date": "2024-03-13",
              "times": ["7:30 PM"]
            },
            {
                "date": "2024-03-14",
                "times": ["7:30 PM"]
            },
              {
                "date": "2024-03-15",
                "times": ["7:30 PM"]
            },
              {
                "date": "2024-03-16",
                "times": ["2:00 PM", "7:30 PM"]
              },
              {
                "date": "2024-03-17",
                "times": ["12:00 PM", "5:30 PM"]
              },
              {
                "date": "2024-03-20",
                "times": ["2:00 PM"]
              },
              {
                "date": "2024-03-21",
                "times": ["7:30 PM"]
              },
              {
                "date": "2024-03-22",
                "times": ["7:30 PM"]
              },
              {
                "date": "2024-03-24",
                "times": ["12:00 PM", "5:30 PM"]
              },
              {
                "date": "2024-03-27",
                "times": ["7:30 PM"]
              },
              {
                "date": "2024-03-28",
                "times": ["7:30 PM"]
              },
              {
                "date": "2024-03-29",
                "times": ["7:30 PM"]
              },
              {
                "date": "2024-03-30",
                "times": ["2:00 PM", "7:30 PM"]
              },
              {
                "date": "2024-03-31",
                "times": ["12:00 PM", "5:30 PM"]
              }



        ],
        "venue": "Leo K. Theater",
        "address": "155 Mercer Street, Seattle, WA 98109",
        "description": "Winter, 2001, Newark, NJ. Two DREAMers—pre-DACA—meet up on the fire escape, which happens most nights. Both undocumented teens, they grapple with life’s challenges, from family to their futures. When one becomes naturalized, she promises to marry the other so he can receive his papers and truly start his life. As time passes and their relationship shifts, both must confront what they are willing to sacrifice to live freely and belong. This searing and captivating new play by Pulitzer Prize-winning Martyna Majok asks what we’re willing to risk for those we love.",
        "condensedDescription": "Winter, 2001, Newark, NJ. Two DREAMers—pre-DACA—meet up on the fire escape, which happens most nights. Both undocumented teens, they grapple with life’s challenges, from family to their futures. When one becomes naturalized, she promises to marry the other so he can receive his papers and truly start his life...",
        "link": "https://www.seattlerep.org/plays/202324-season/sanctuary-city/performances",
        "image": "/images/sanctuary-city.webp",
        "alt": "Sanctuary City Play Banner",
        "reviewOne": "A vivid glimpse into the personal costs of living in limbo as a Dreamer. - DC THEATER ARTS",
        "reviewTwo": "Teens may appreciate a play that revolves around other young people, but moments of teenage levity are few. - ANONYMOUS"
    },
    {
        "eventId": "3",
        "eventName": "Luchadora!",
        "directorOrganizer": "Johamy Morales",
        "type": "Play",
        "size": "large",
        "cost": "medium",
        "start": "2024-02-22",
        "endDate": "2024-03-17",
        "sessions": [
            {
              "date": "2024-03-10",
              "times": ["1:00 PM", "4:30 PM"]
            },
            {
              "date": "2024-03-16",
              "times": ["1:00 PM", "4:30 PM"]
            },
            {
                "date": "2024-03-17",
                "times": ["1:00 PM", "4:30 PM"]
            }



        ],
        "venue": "Charlotte Martin Theatre",
        "address": "2nd Ave N, Seattle, WA 98109",
        "description": "Transport yourself to the world of lucha libre—Mexican wrestling, with this inspired adaptation of the Chinese legend Hua Mulan. The discovery of a worn pink wrestling mask prompts Nana Lupita, a Washington grandmother, to share her coming of age story growing up in 1960s Texas. As we follow Lupita’s journey, we witness her life as a daring teen tomboy; bike riding with her friends, working at her father’s flower stand, and lucha libre. When a World Championship match is announced, Lupita’s excitement explodes; she anticipates seeing it until she discovers her ailing father is one of the wrestlers. With the help of a magical mask maker, Lupita secretly trains to take her father’s place. She soon finds it difficult keeping her secret from her friends and, most importantly, her father.",
        "condensedDescription": "Transport yourself to the world of lucha libre—Mexican wrestling, with this inspired adaptation of the Chinese legend Hua Mulan. The discovery of a worn pink wrestling mask prompts Nana Lupita, a Washington grandmother, to share her coming of age story growing up in 1960s Texas. As we follow Lupita’s journey, we witness her life as a daring teen tomboy; bike riding with her friends, working at her father’s flower stand, and lucha libre...",
        "link": "https://www.sct.org/onstage/productions/luchadora-2/",
        "image": "/images/luchadora.webp",
        "alt": "Actors on stage for Luchadora!",
        "reviewOne": "I'm gonna start wrestling now. It's my new dream. - KID WHO SAW LUCHADORA!",
        "reviewTwo": "Our daughters left the theater on Saturday feeling happy and inspired and asked to come see it again. I would recommend it to anyone!! - TANYA V."
    },
    {
        "eventId": "4",
        "eventName": "Misfit Cabaret presents \"Grimm\"",
        "directorOrganizer": "Kat Robicharud",
        "type": "Cabaret",
        "size": "large",
        "cost": "high",
        "start": "2024-03014",
        "endDate": "2024-03-16",
        "sessions": [
            {
              "date": "2024-03-14",
              "times": ["7:30 PM"]
            },
            {
              "date": "2024-03-15",
              "times": ["6:00 AM", "9:30 PM"]
            },
            {
                "date": "2024-03-16",
                "times": ["6:00 AM", "9:30 PM"]
            }



        ],
        "venue": "The Triple Door",
        "address": "216 Union St, Seattle, WA 98101",
        "description": "Come spend an enchanted fairytale evening with a tour de force of talent at the stunning Triple Door for a San Francisco based touring variety show! Kat Robichaud proudly presents her Misfit Cabaret: Grimm– a night of decadence, bawdiness, and damsels (not) in distress. Experience the fantastical Rock and Roll variety show everyone is talking about! Enjoy a devilish drag performance from Johnny Rockitt, get serenaded by our special songbird Eliza Rickman, soar high in the air with our stunning aerialist, be completely spell-bound by Alice as she peers through the looking glass, and look in awe at the puppets of Shadow Circus Creature Theater!",
        "condensedDescription": "Kat Robichaud proudly presents her Misfit Cabaret: Grimm– a night of decadence, bawdiness, and damsels (not) in distress. Experience the fantastical Rock and Roll variety show everyone is talking about!",
        "link": "https://tickets.thetripledoor.net/eventperformances.asp?evt=2011",
        "image": "/images/grimm.jpeg",
        "alt": "Grimm cabaret performance",
        "reviewOne": "Robichaud...and the Darling Misfits completely nail the nuances of bombastic, arena-sized rock n' roll that would make Queen proud. - THE TRIPLE DOOR",
        "reviewTwo": "Misfit Cabaret is exciting and fun simply because you never know what you’ll get. The shows are a compilation of acts, stories, and songs, all emceed by Robichaud. - SPLASH MAGAZINES"
    },
    {
        "eventId": "5",
        "eventName": "Neumos 20th Anniversary Party",
        "directorOrganizer": "Neumos",
        "type": "Concert",
        "size": "large",
        "cost": "low",
        "start": "2024-02-28",
        "endDate": "2024-02-28",
        "sessions": [
            {
              "date": "2024-02-28",
              "times": ["7:00 PM"]
            }



        ],
        "venue": "Neumos",
        "address": "925 E Pike St, Seattle, WA 98122",
        "description": "Come celebrate 20 years of Neumos! Feat. Spirit Award + THEM + DJ Abbie & Troy of KEXP and an archived screen print posters sale!",
        "condensedDescription": "Come celebrate 20 years of Neumos! Feat. Spirit Award + THEM + DJ Abbie & Troy of KEXP and an archived screen print posters sale!",
        "link": "https://www.axs.com/events/531087/neumos-20th-anniversary-party-tickets",
        "image": "/images/neumos-20th.png",
        "alt": "The outside of the Neumos venue",
        "reviewOne": "The night was amazing and would come back again for sure. There is only street parking near this place. - SINDU K.",
        "reviewTwo": "I think this venue is good size for concert or event and yet feel it intimate. - ANA M."
    },
    {
        "eventId": "6",
        "eventName": "Becoming Dr. Ruth",
        "directorOrganizer": "Holly Twyford",
        "type": "Play",
        "size": "medium",
        "cost": "medium",
        "start": "2024-01-16",
        "endDate": "2024-02-18",
        "sessions": [
            {
              "date": "2024-03-10",
              "times": ["2:00 PM", "7:00 PM"]
            },
            {
              "date": "2024-03-13",
              "times": ["7:30 PM"]
            },
            {
                "date": "2024-03-14",
                "times": ["2:00 PM", "7:30 PM"]
            },
              {
                "date": "2024-03-15",
                "times": ["8:00 PM"]
            },
            {
                "date": "2024-03-16",
                "times": ["2:00 PM", "8:00 PM"]
              },
              {
                "date": "2024-03-17",
                "times": ["2:00 PM"]
              }



        ],
        "venue": "Everett Performing Arts Center",
        "address": "2710 Wetmore Avenue, Everett, WA 98201",
        "description": "She’s America’s favorite sex therapist!  Before she became Dr. Ruth, Karola Ruth Siegel had to flee Nazi Germany on the Kindertransport, become a sharpshooter in Jerusalem, and survive as a single mother in America. Filled with irrepressible wit, joy, and honesty, Becoming Dr. Ruth tells the triumphant and life-affirming story of a woman who—through her perseverance, indefatigable spirit, and bravery— carved her own unique place in the world. Acclaimed actress Naomi Jacobson reprises the role that has garnered her ovations across the country in this tour-de-force one woman play. Becoming Dr. Ruth promises an unforgettable, hilarious, and uplifting evening of theater that will touch your soul and heart.",
        "condensedDescription": "She’s America’s favorite sex therapist!  Before she became Dr. Ruth, Karola Ruth Siegel had to flee Nazi Germany on the Kindertransport, become a sharpshooter in Jerusalem, and survive as a single mother in America...",
        "link": "https://everout.com/seattle/events/becoming-dr-ruth/e142339/",
        "image": "/images/dr-ruth.png",
        "alt": "Dr. Ruth Actress",
        "reviewOne": "With a set that can’t leave your mind after stepping out of the Issaquah theater, and a leading lady who steals the show... Becoming Dr. Ruth is a labor of love and arduous work by all those involved. - BROADWAY WORLD",
        "reviewTwo": "The \"whole of Dr. Ruth’s life seemed to hover, a silently turning magnet still resonating in the heart.\" - DRAMA IN THE HOOD"
    },
    {
        "eventId": "7",
        "eventName": "Duo Comedy Showcase",
        "directorOrganizer": "Unexpected Productions",
        "size": "small",
        "cost": "low",
        "type": "Other",
        "start": "2024-02-28",
        "endDate": "2024-06-26",
        "sessions": [
            {
              "date": "2024-02-28",
              "times": ["8:00 PM"]
            },
            {
              "date": "2024-03-06",
              "times": ["8:00 PM"]
            },
            {
                "date": "2024-03-13",
                "times": ["8:00 PM"]
            },
              {
                "date": "2024-03-20",
                "times": ["8:00 PM"]
            },
            {
                "date": "2024-03-27",
                "times": ["8:00 PM"]
            },
              {
                "date": "2024-04-03",
                "times": ["8:00 PM"]
            },
            {
                "date": "2024-04-10",
                "times": ["8:00 PM"]
            },
            {
                "date": "2024-04-17",
                "times": ["8:00 PM"]
            },
            {
                "date": "2024-04-24",
                "times": ["8:00 PM"]
            }



        ],
        "venue": "Unexpected Productions Market Theater",
        "address": "1428 Post Alley, Seattle, WA 98101",
        "description": "Duo Comedy Showcase is Seattle's only public open mic for improv. Two-person teams doing what they do best: creating spontaneous scenes on the fly that are so hilarious, quick-witted, and perfectly constructed it's hard to believe they are made up on the spot. At Duos, newer improvisers have an opportunity to improve while professional improvisers practice and try new things. Who knows, you might even want to join them.",
        "condensedDescription": "Duo Comedy Showcase is Seattle's only public open mic for improv. Two-person teams doing what they do best: creating spontaneous scenes on the fly that are so hilarious, quick-witted, and perfectly constructed it's hard to believe they are made up on the spot...",
        "link": "https://www.eventbrite.com/e/duo-comedy-showcase-2024-tickets-767806398607?aff=oddtdtcreator",
        "image": "/images/duo-comedy.webp",
        "alt": "Person doing stand-up at Duo Comedy Showcase",
        "reviewOne": "It kept my attention the whole time. We will definitely be back! - SYDNEY F.",
        "reviewTwo": "What a fabtastic show! We loved the actors and the energy they gave to the crowd! Host nailed it and wonderfully engaged with the audience. - ERIKA J."
    },
    {
        "eventId": "8",
        "eventName": "Memoirs of a Forgotten Man",
        "directorOrganizer": "Terry Edward Moore",
        "type": "Play",
        "size": "small",
        "cost": "medium",
        "start": "2024-02-22",
        "endDate": "2024-03-09",
        "sessions": [
            {
              "date": "2024-02-25",
              "times": ["2:00 PM"]
            },
            {
              "date": "2024-02-29",
              "times": ["7:30 PM"]
            },
            {
                "date": "2024-03-01",
                "times": ["7:30 PM"]
            },
              {
                "date": "2024-03-03",
                "times": ["7:30 PM"]
            },
            {
                "date": "2024-03-04",
                "times": ["7:30 PM"]
            },
            {
                "date": "2024-03-07",
                "times": ["7:30 PM"]
              },
              {
                "date": "2024-03-08",
                "times": ["7:30 PM"]
              },
            {
                "date": "2024-03-09",
                "times": ["2:00 PM", "7:30 PM"]
              }



        ],
        "venue": "12th Avenue Arts",
        "address": "1620 12th Ave #203, Seattle, WA 98122",
        "description": "A man in Stalin’s Russia has a perfect memory. When the State tells him to forget someone, he can’t…and then he disappears. A Soviet official is searching for him, and he tries to enlist the help of the psychologist who studied him. But are the official’s reasons political or personal? or both? A slippery examination of the connections between memory and identity, MEMOIRS OF A FORGOTTEN MAN also counts the costs we pay when the State decides what the truth is.",
        "condensedDescription": "A slippery examination of the connections between memory and identity, MEMOIRS OF A FORGOTTEN MAN also counts the costs we pay when the State decides what the truth is...",
        "link": "https://thaliamemoirs.brownpapertickets.com",
        "image": "/images/memoirs.jpeg",
        "alt": "Two actors from Memoirs of a Forgotten Man",
        "reviewOne": "Overall, Memoirs of a Forgotten Man is a truly outstanding show that I highly recommend to young adults and elders. - DRAMA IN THE HOOD",
        "reviewTwo": "An outstanding cast that compliments each other through each scene, character change, and memory test. - BROADWAY WORLD"
    },
    {
        "eventId": "9",
        "eventName": "Something's Afoot",
        "directorOrganizer": "Bill Berry",
        "type": "Musical",
        "size": "large",
        "cost": "high",
        "start": "2024-03-01",
        "endDate": "2024-03-24",
        "sessions": [
            {
              "date": "2024-03-10",
              "times": ["7:30 PM"]
            },
            {
              "date": "2024-03-13",
              "times": ["7:30 PM"]
            },
            {
                "date": "2024-03-14",
                "times": ["7:30 PM"]
            },
              {
                "date": "2024-03-15",
                "times": ["7:30 PM"]
            },
            {
                "date": "2024-03-16",
                "times": ["1:30 PM", "7:30 PM"]
            },
            {
                "date": "2024-03-17",
                "times": ["1:30 PM"]
              },
              {
                "date": "2024-03-20",
                "times": ["7:30 PM"]
              },
              {
                "date": "2024-03-21",
                "times": ["1:30 PM", "7:30 PM"]
            },
            {
                "date": "2024-03-22",
                "times": ["7:30 PM"]
              },
            {
                "date": "2024-03-23",
                "times": ["1:30 PM", "7:30 PM"]
              },
              {
                "date": "2024-03-24",
                "times": ["1:30 PM"]
              }



        ],
        "venue": "The Fifth Avenue Theatre",
        "address": "1308 5th Ave, Seattle, WA 98101",
        "description": "Prepare to laugh until it hurts with this musical spoof of the whodunit genre. Something’s Afoot pokes fun at Agatha Christie murder mysteries; ten people are stranded in an isolated country estate during a raging thunderstorm. One by one, they are picked off by cleverly fiendish devices. As bodies pile up, the survivors frantically race to solve the mystery! Join in the tomfoolery of this farcical, raucous, and outrageous play that will appeal to lovers of shows like Arrested Development, The Office, and Schitt’s Creek.",
        "condensedDescription": "Prepare to laugh until it hurts with this musical spoof of the whodunit genre. Something’s Afoot pokes fun at Agatha Christie murder mysteries; ten people are stranded in an isolated country estate during a raging thunderstorm...",
        "link": "https://my.5thavenue.org/2324-somethings-afoot",
        "image": "/images/somethings-afoot.jpeg",
        "alt": "Cast of Something's Afoot",
        "reviewOne": "Went to see Something's Afoot today and really enjoyed it...The cast, musicians and behind the scenes people were excellent. - TINA M.",
        "reviewTwo": "The critics were wrong...this show was great! What a wonderful, fun night out. Excellent cast, entertaining dialogue, wonderful songs. - CAT C."
    },
    {
        "eventId": "10",
        "eventName": "Cornish Dance Capstone Concert",
        "directorOrganizer": "Cornish College of the Arts",
        "type": "Dance",
        "size": "medium",
        "cost": "low",
        "start": "2024-01-01",
        "endDate": "2024-03-02",
        "sessions": [
            {
              "date": "2024-03-01",
              "times": ["8:00 PM"]
            },
            {
              "date": "2024-03-02",
              "times": ["2:00 PM", "8:00 PM"]
            }



        ],
        "venue": "Cornish Playhouse",
        "address": "201 Mercer St, Seattle, WA 98109",
        "description": "Cornish Dance Seniors present their Capstone Projects in the form of choreography, performance, site-specific work, and screendance. These students engage in a creative process that reflects on their dance research over their time at Cornish and culminates in a shared performance of diverse works at the Cornish Playhouse on March 1-2, 2024.",
        "condensedDescription": "Cornish Dance Seniors present their Capstone Projects in the form of choreography, performance, site-specific work, and screendance...",
        "link": "https://cornishtickets.ludus.com/index.php",
        "image": "/images/cornish.jpeg",
        "alt": "Dancers from Cornish College of the Arts",
        "reviewOne": "I have known several people from my school who have gone there and graduated, and they have all said it's a fabulous school. - DUDLEY",
        "reviewTwo": "This school; the teachers, the students, the assignments, they really make you break away from your comfort zone and go past the boundaries that you have built up for yourself. - ELIZABETH"
    },
    {
        "eventId": "11",
        "eventName": "Shakespeare in Love",
        "directorOrganizer": "Declan Donnellan",
        "type": "Play",
        "size": "medium",
        "cost": "medium",
        "start": "2024-02-16",
        "endDate": "2024-03-03",
        "sessions": [
            {
              "date": "2024-02-16",
              "times": ["7:30 PM"]
            },
            {
              "date": "2024-02-17",
              "times": ["7:30 PM"]
            },
            {
                "date": "2024-02-18",
                "times": ["7:30 PM"]
            },
              {
                "date": "2024-02-22",
                "times": ["7:30 PM"]
            },
            {
                "date": "2024-02-23",
                "times": ["1:30 PM", "7:30 PM"]
            },
            {
                "date": "2024-02-24",
                "times": ["1:30 PM"]
              },
              {
                "date": "2024-02-25",
                "times": ["7:30 PM"]
              },
              {
                "date": "2024-02-29",
                "times": ["1:30 PM", "7:30 PM"]
            },
            {
                "date": "2024-03-01",
                "times": ["7:30 PM"]
              },
            {
                "date": "2024-03-02",
                "times": ["1:30 PM", "7:30 PM"]
              },
              {
                "date": "2024-03-03",
                "times": ["1:30 PM"]
              }



        ],
        "venue": "Valley Center Stage",
        "address": "1060 Stilson Ave SE, North Bend, WA 98045",
        "description": "Penniless and indebted to two demanding producers, struggling young playwright William Shakespeare is tormented by writer’s block until he meets the beautiful Viola de Lesseps, daughter of a wealthy merchant,whose fiery passion for poetry and drama leaves her secretly longing to be an actor. Both are despondent when they learn that Viola’s father has promised her to the stuffy Lord Wessex in order to gain a eventName for their family. Under the veil of secrecy, Will and Viola’s passionate love affair becomes the basis of the very play he is writing – Romeo and Juliet. With opening night – and the wedding day – fast approaching, the plots race toward a parallel conclusion. Will it all work out in the end or are the two star-crossed lovers bound for tragedy?",
        "condensedDescription": "Penniless and indebted to two demanding producers, struggling young playwright William Shakespeare is tormented by writer’s block until he meets the beautiful Viola de Lesseps, daughter of a wealthy merchant,whose fiery passion for poetry and drama leaves her secretly longing to be an actor...",
        "link": "https://www.tickettailor.com/events/vcs/1071172?#",
        "image": "/images/shakespeare-in-love.jpeg",
        "alt": "Stage and actors for Shakespeare in Love",
        "reviewOne": "You could feel it throughout how much reverence they all had for this story...they were telling due to its connections with the works of Shakespeare and that gave it heart. - BROADWAY WORLD",
        "reviewTwo": "Watched the stage production of Shakespeare In Love. For a guy who hates English literature and William Shakespeare, I was pleasantly surprised how much I enjoyed this play. - SHOWS I'VE SEEN"
    },
    {
        "eventId": "12",
        "eventName": "Loosegroove Records Presents:",
        "directorOrganizer": "Loosegrove Records",
        "type": "Concert",
        "size": "medium",
        "cost": "low",
        "start": "2024-03-01",
        "endDate": "2024-03-01",
        "sessions": [
            {
              "date": "2024-03-01",
              "times": ["7:00 PM"]
            }



        ],
        "venue": "The Rabbit Box Theatre",
        "address": "94 Pike St, Seattle, WA 98101",
        "description": "Loosegroove Records Presents an Intimate Evening of Music with Brittany Davis, Zoser, Mason Jennings and Jonny Polonsky.",
        "condensedDescription": "Loosegroove Records Presents an Intimate Evening of Music with Brittany Davis, Zoser, Mason Jennings and Jonny Polonsky.",
        "link": "https://dice.fm/partner/the-carryall-dba-the-rabbit-box/event/k5l2p-loosegroove-record-presents-an-intimate-evening-of-music-1st-mar-the-rabbit-box-seattle-tickets?dice_id=2414808&dice_channel=web&dice_tags=organic&dice_campaign=The+Carryall+dba+The+Rabbit+Box&dice_feature=mio_marketing&_branch_match_id=820029299867623924&_branch_referrer=H4sIAAAAAAAAA8soKSkottLXz8nMy9ZLyUxO1UvL1XdNMjNLSkwxTDJPMwIAhPa4KCEAAAA%3D",
        "image": "/images/loosegrove.jpeg",
        "alt": "Brittany Davis, Zoser, Mason Jennings, and Jonny Polonsky together",
        "reviewOne": "Brittany Davis' set swims in that much-missed alchemy where everyone in a given room is carried forward by the same sounds. - NPR",
        "reviewTwo": "Brittany Davis is “just a phenomenal musician and a charming and energizing human being...They can fit in on any song and find a spot and be so powerful. - OM JOHARI"
    },
    {
        "eventId": "13",
        "eventName": "The Moors",
        "directorOrganizer": "Annie Lareau",
        "type": "Play",
        "size": "small",
        "cost": "medium",
        "start": "2024-03-24",
        "endDate": "2024-04-14",
        "sessions": [
            {
              "date": "2024-03-22",
              "times": ["7:30 PM"]
            },
            {
              "date": "2024-03-23",
              "times": ["7:30 PM"]
            },
            {
                "date": "2024-03-24",
                "times": ["2:00 PM"]
            },
              {
                "date": "2024-03-28",
                "times": ["7:30 PM"]
            },
            {
                "date": "2024-03-29",
                "times": ["7:30 PM"]
            },
              {
                "date": "2024-03-30",
                "times": ["7:30 PM"]
              },
              {
                "date": "2024-03-31",
                "times": ["2:00 PM"]
            },
            {
                "date": "2024-04-04",
                "times": ["7:30 PM"]
              },
              {
                "date": "2024-04-05",
                "times": ["7:30 PM"]
              },
              {
                "date": "2024-04-06",
                "times": ["7:30 PM"]
              },
              {
                "date": "2024-04-07",
                "times": ["2:00 PM"]
              },
              {
                "date": "2024-04-11",
                "times": ["7:30 PM"]
              },
              {
                "date": "2024-04-12",
                "times": ["7:30 PM"]
              },
              {
                "date": "2024-04-13",
                "times": ["7:30 PM"]
              },
              {
                "date": "2024-04-14",
                "times": ["2:00 PM"]
              }



        ],
        "venue": "Seattle Public Theater",
        "address": "7312 West Green Lake Dr N, Seattle, WA 98103",
        "description": "Two sisters and a dog live out their lives on the bleak English moors, dreaming of love and power. The arrival of a hapless governess and a moor-hen set all three on a strange and dangerous path. The Moors is a dark comedy about love, desperation, and visibility.",
        "condensedDescription": "The Moors is a dark comedy about love, desperation, and visibility...",
        "link": "https://app.arts-people.com/index.php?actions=4&p=1",
        "image": "/images/the-moors.jpeg",
        "alt": "Cast of The Moors on stage, in costume",
        "reviewOne": "Leaving the crowd, deep in thought, viewers won’t help but wonder, “What just happened?” - HUNTINGTON NEWS",
        "reviewTwo": "this is what I love about Mildred’s Umbrella—they keep trying new, edgy things, with superlative actors. They aren’t afraid of the wildness of the moors. - HOUSTONIA"
    },
    {
        "eventId": "14",
        "eventName": "Fat Ham",
        "directorOrganizer": "Timothy McCuen Piggee",
        "type": "Play",
        "size": "small",
        "cost": "low",
        "start": "2024-04-12",
        "endDate": "2024-05-12",
        "sessions": [
            {
              "date": "2024-04-12",
              "times": ["7:30 PM"]
            },
            {
              "date": "2024-04-13",
              "times": ["7:30 PM"]
            },
            {
                "date": "2024-04-14",
                "times": ["7:30 PM"]
            },
              {
                "date": "2024-04-16",
                "times": ["7:30 PM"]
            },
            {
                "date": "2024-04-17",
                "times": ["7:30 PM"]
            },
            {
                "date": "2024-04-19",
                "times": ["7:30 PM"]
              },
              {
                "date": "2024-04-20",
                "times": ["2:00 PM", "7:30 PM"]
              },
              {
                "date": "2024-04-21",
                "times": ["12:00 PM", "5:30 PM"]
            },
            {
                "date": "2024-04-24",
                "times": ["7:30 PM"]
              },
              {
                "date": "2024-04-25",
                "times": ["7:30 PM"]
              },
              {
                "date": "2024-04-26",
                "times": ["7:30 PM"]
              },
              {
                "date": "2024-04-27",
                "times": ["2:00 PM", "7:30 PM"]
              },
              {
                "date": "2024-04-28",
                "times": ["12:00 PM", "5:30 PM"]
              },
              {
                "date": "2024-05-01",
                "times": ["2:00 PM", "7:30 PM"]
              },
              {
                "date": "2024-04-13",
                "times": ["7:30 PM"]
              },
              {
                "date": "2024-05-02",
                "times": ["7:30 PM"]
              }



        ],
        "venue": "Bagley Wright Theater",
        "address": "155 Mercer St, Seattle, WA 98109",
        "description": "Juicy, a young queer Black man, has a lot on his plate. His mother just married his uncle after the untimely death of his father, whose ghost appears at a family barbecue demanding that Juicy avenge his murder. Sound familiar? Fresh from its Broadway debut, this Pulitzer Prize-winning play inspired by Shakespeare’s Hamlet is a sparkling and uproarious new comedy about seeking love and liberation.",
        "condensedDescription": "Fresh from its Broadway debut, this Pulitzer Prize-winning play inspired by Shakespeare’s Hamlet is a sparkling and uproarious new comedy about seeking love and liberation...",
        "link": "https://www.seattlerep.org/plays/202324-season/fat-ham/performances",
        "image": "/images/fat-ham.jpeg",
        "alt": "Banner for Fat Ham",
        "reviewOne": "A modern gloss on “Hamlet” set at a backyard barbecue remakes the tragedy as a comedy, and as a challenge for today. - NY TIMES",
        "reviewTwo": "By turns sweet and saucy (and very funny), the play stays just close enough to Hamlet to keep us off-balance. - DEADLINE"
    },
    {
        "eventId": "15",
        "eventName": "Unstoppable: A Queer Dancical",
        "directorOrganizer": "Zheng Wang",
        "type": "Dance",
        "size": "large",
        "cost": "low",
        "start": "2024-02-16",
        "endDate": "2024-03-03",
        "sessions": [
            {
              "date": "2024-02-18",
              "times": ["2:00 PM"]
            },
            {
              "date": "2024-02-25",
              "times": ["2:00 PM"]
            },
            {
                "date": "2024-03-03",
                "times": ["2:00 PM"]
            }




        ],
        "venue": "Broadway Performance Hall",
        "address": "1625 Broadway, Seattle, WA 98122",
        "description": "WORLD PREMIERE! Conceived as both a play and a dance show, Unstoppable: A Queer Dancical is an unapologetic ode to the power and resilience of the LGBTQ+ community. The story follows Nikki and Keith, best friends from a small town, as they experience the communitys response to a hate crime incident. Expect love stories, political drama, fabulous drag queens, and 20+ dance numbers set to familiar pop hits. Pioneering a new format that speaks to fans of musicals, dance shows, and traditional plays, Unstoppable: A Queer Dancical is an emotional journey that aims to inspire hope and unity in all of us.",
        "condensedDescription": "WORLD PREMIERE! Conceived as both a play and a dance show, Unstoppable: A Queer Dancical is an unapologetic ode to the power and resilience of the LGBTQ+ community...",
        "link": "https://www.brownpapertickets.com/event/6221112",
        "image": "/images/unstoppable-dancical.jpeg",
        "alt": "Cast of Unstoppable standing in a triangle formation",
        "reviewOne": "SUCH a wonderful, creative show! It is brimming with originality and sincerity. - SARAH M.",
        "reviewTwo": "An incredibly real and moving piece of artwork, I absolutely LOVED it! - ANONYMOUS"
    }
]